// Axel '0vercl0k' Souchet - January 22 2022
#pragma once
#include <algorithm>
#include <cinttypes>
#include <cstdint>
#include <cstdio>
#include <cstring>
#include <map>
#include <optional>
#include <string>
#include <unordered_map>
#include <variant>
#include <vector>
#include <cstdlib>

#if defined(__i386__) || defined(_M_IX86)
#define ARCH_X86
#elif defined(__amd64__) || defined(_M_X64)
#define ARCH_X64
#elif defined(__arm__) || defined(_M_ARM)
#define ARCH_ARM
#elif defined(__aarch64__) || defined(_M_ARM64)
#define ARCH_AARCH64
#elif defined(__EMSCRIPTEN__)
#else
#error Platform not supported.
#endif

#if defined(_WIN32)

#define WINDOWS
#include <Windows.h>

#if defined(ARCH_X86)
#define WINDOWS_X86
#elif defined(ARCH_X64)
#define WINDOWS_X64
#elif defined(ARCH_ARM)
#define WINDOWS_ARM
#elif defined(ARCH_AARCH64)
#define WINDOWS_AARCH64
#endif // ARCH_XXX

#elif defined(linux) || defined(__linux) || defined(__FreeBSD__) ||            \
defined(__FreeBSD_kernel__) || defined(__MACH__) || defined(__EMSCRIPTEN__)

#define LINUX
#include <errno.h>
#include <fcntl.h>
#include <sys/mman.h>
#include <sys/stat.h>
#include <sys/types.h>
#include <unistd.h>

#if defined(ARCH_X86)
#define LINUX_X86
#elif defined(ARCH_X64)
#define LINUX_X64
#elif defined(ARCH_ARM)
#define LINUX_ARM
#elif defined(ARCH_AARCH64)
#define LINUX_AARCH64
#endif // ARCH_XXX

#else

#error Platform not supported.

#endif // _WIN32

namespace udmpparser
{
#pragma pack(push)
#pragma pack(1)

    enum class ProcessorArch_t : uint16_t
    {
        X86 = 0,
        ARM = 5,
        IA64 = 6,
        AMD64 = 9,
        Unknown = 0xffff
    };

    constexpr uint32_t kWOW64_SIZE_OF_80387_REGISTERS = 80;

    struct FloatingSaveArea32_t
    {
        uint32_t ControlWord;
        uint32_t StatusWord;
        uint32_t TagWord;
        uint32_t ErrorOffset;
        uint32_t ErrorSelector;
        uint32_t DataOffset;
        uint32_t DataSelector;
        uint8_t RegisterArea[kWOW64_SIZE_OF_80387_REGISTERS];
        uint32_t Cr0NpxState;
    };

    static_assert(sizeof(FloatingSaveArea32_t) == 0x70);

    constexpr uint32_t kWOW64_MAXIMUM_SUPPORTED_EXTENSION = 512;

    struct Context32_t
    {
        uint32_t ContextFlags;
        uint32_t Dr0;
        uint32_t Dr1;
        uint32_t Dr2;
        uint32_t Dr3;
        uint32_t Dr6;
        uint32_t Dr7;
        FloatingSaveArea32_t FloatSave;
        uint32_t SegGs;
        uint32_t SegFs;
        uint32_t SegEs;
        uint32_t SegDs;
        uint32_t Edi;
        uint32_t Esi;
        uint32_t Ebx;
        uint32_t Edx;
        uint32_t Ecx;
        uint32_t Eax;
        uint32_t Ebp;
        uint32_t Eip;
        uint32_t SegCs;
        uint32_t EFlags;
        uint32_t Esp;
        uint32_t SegSs;
        uint8_t ExtendedRegisters[kWOW64_MAXIMUM_SUPPORTED_EXTENSION];
    };

    static_assert(sizeof(Context32_t) == 0x2cc);

    struct uint128_t
    {
        uint64_t Low;
        uint64_t High;
    };

    static_assert(sizeof(uint128_t) == 0x10);

    struct Context64_t
    {
        uint64_t P1Home;
        uint64_t P2Home;
        uint64_t P3Home;
        uint64_t P4Home;
        uint64_t P5Home;
        uint64_t P6Home;
        uint32_t ContextFlags;
        uint32_t MxCsr;
        uint16_t SegCs;
        uint16_t SegDs;
        uint16_t SegEs;
        uint16_t SegFs;
        uint16_t SegGs;
        uint16_t SegSs;
        uint32_t EFlags;
        uint64_t Dr0;
        uint64_t Dr1;
        uint64_t Dr2;
        uint64_t Dr3;
        uint64_t Dr6;
        uint64_t Dr7;
        uint64_t Rax;
        uint64_t Rcx;
        uint64_t Rdx;
        uint64_t Rbx;
        uint64_t Rsp;
        uint64_t Rbp;
        uint64_t Rsi;
        uint64_t Rdi;
        uint64_t R8;
        uint64_t R9;
        uint64_t R10;
        uint64_t R11;
        uint64_t R12;
        uint64_t R13;
        uint64_t R14;
        uint64_t R15;
        uint64_t Rip;
        uint16_t ControlWord;
        uint16_t StatusWord;
        uint8_t TagWord;
        uint8_t Reserved1;
        uint16_t ErrorOpcode;
        uint32_t ErrorOffset;
        uint16_t ErrorSelector;
        uint16_t Reserved2;
        uint32_t DataOffset;
        uint16_t DataSelector;
        uint16_t Reserved3;
        uint32_t MxCsr2;
        uint32_t MxCsr_Mask;
        uint128_t FloatRegisters[8];
        uint128_t Xmm0;
        uint128_t Xmm1;
        uint128_t Xmm2;
        uint128_t Xmm3;
        uint128_t Xmm4;
        uint128_t Xmm5;
        uint128_t Xmm6;
        uint128_t Xmm7;
        uint128_t Xmm8;
        uint128_t Xmm9;
        uint128_t Xmm10;
        uint128_t Xmm11;
        uint128_t Xmm12;
        uint128_t Xmm13;
        uint128_t Xmm14;
        uint128_t Xmm15;
        uint8_t Padding[0x60];
        uint128_t VectorRegister[26];
        uint64_t VectorControl;
        uint64_t DebugControl;
        uint64_t LastBranchToRip;
        uint64_t LastBranchFromRip;
        uint64_t LastExceptionToRip;
        uint64_t LastExceptionFromRip;
    };

    static_assert(offsetof(Context64_t, Xmm0) == 0x1a0);
    static_assert(offsetof(Context64_t, VectorRegister) == 0x300);
    static_assert(sizeof(Context64_t) == 0x4d0);

    namespace dmp
    {

        struct Header_t
        {
            static const uint32_t ExpectedSignature = 0x50'4d'44'4d; // 'PMDM';
            static const uint32_t ValidFlagsMask = 0x00'1f'ff'ff;
            uint32_t Signature;
            uint16_t Version;
            uint16_t ImplementationVersion;
            uint32_t NumberOfStreams;
            uint32_t StreamDirectoryRva;
            uint32_t CheckSum;
            uint32_t Reserved;
            uint32_t TimeDateStamp;
            uint32_t Flags;

            bool LooksGood() const
            {
                if(Signature != ExpectedSignature)
                {
                    printf("The signature (%" PRIx32
                           ") does not match the expected signature.\n",
                           Signature);
                    return false;
                }

                if((Flags & ValidFlagsMask) != Flags)
                {
                    printf("The flags have unknown bits set.\n");
                    return false;
                }

                if(NumberOfStreams == 0)
                {
                    printf("There is no streams.\n");
                    return false;
                }

                return true;
            }
        };

        static_assert(sizeof(Header_t) == 0x20);

        struct LocationDescriptor32_t
        {
            uint32_t DataSize = 0;
            uint32_t Rva = 0;
        };

        static_assert(sizeof(LocationDescriptor32_t) == 0x8);

        struct LocationDescriptor64_t
        {
            uint64_t DataSize = 0;
            uint64_t Rva = 0;
        };

        static_assert(sizeof(LocationDescriptor64_t) == 0x10);

        enum class StreamType_t : uint32_t
        {
            Unused = 0,
            ThreadList = 3,
            ModuleList = 4,
            Exception = 6,
            SystemInfo = 7,
            Memory64List = 9,
            MemoryInfoList = 16,
        };

        struct Directory_t
        {
            StreamType_t StreamType = StreamType_t::Unused;
            LocationDescriptor32_t Location;
        };

        static_assert(sizeof(Directory_t) == 0xC);

        struct Memory64ListStreamHdr_t
        {
            uint64_t NumberOfMemoryRanges = 0;
            uint64_t BaseRva = 0;
        };

        static_assert(sizeof(Memory64ListStreamHdr_t) == 0x10);

        struct MemoryDescriptor64_t
        {
            uint64_t StartOfMemoryRange = 0;
            uint64_t DataSize = 0;
        };

        static_assert(sizeof(MemoryDescriptor64_t) == 0x10);

        struct FixedFileInfo_t
        {
            uint32_t Signature = 0;
            uint32_t StrucVersion = 0;
            uint32_t FileVersionMS = 0;
            uint32_t FileVersionLS = 0;
            uint32_t ProductVersionMS = 0;
            uint32_t ProductVersionLS = 0;
            uint32_t FileFlagsMask = 0;
            uint32_t FileFlags = 0;
            uint32_t FileOS = 0;
            uint32_t FileType = 0;
            uint32_t FileSubtype = 0;
            uint32_t FileDateMS = 0;
            uint32_t FileDateLS = 0;
        };

        static_assert(sizeof(FixedFileInfo_t) == 0x34);

        struct ModuleEntry_t
        {
            uint64_t BaseOfImage = 0;
            uint32_t SizeOfImage = 0;
            uint32_t CheckSum = 0;
            uint32_t TimeDateStamp = 0;
            uint32_t ModuleNameRva = 0;
            FixedFileInfo_t VersionInfo;
            LocationDescriptor32_t CvRecord;
            LocationDescriptor32_t MiscRecord;
            uint64_t Reserved0 = 0;
            uint64_t Reserved1 = 0;
        };

        static_assert(sizeof(ModuleEntry_t) == 0x6c);

        struct MemoryInfoListStream_t
        {
            uint32_t SizeOfHeader = 0;
            uint32_t SizeOfEntry = 0;
            uint64_t NumberOfEntries = 0;
        };

        static_assert(sizeof(MemoryInfoListStream_t) == 0x10);

        struct MemoryInfo_t
        {
            uint64_t BaseAddress = 0;
            uint64_t AllocationBase = 0;
            uint32_t AllocationProtect = 0;
            uint32_t __alignment1 = 0;
            uint64_t RegionSize = 0;
            uint32_t State = 0;
            uint32_t Protect = 0;
            uint32_t Type = 0;
            uint32_t __alignment2 = 0;
        };

        static_assert(sizeof(MemoryInfo_t) == 0x30);

        struct MemoryDescriptor_t
        {
            uint64_t StartOfMemoryRange = 0;
            LocationDescriptor32_t Memory;
        };

        static_assert(sizeof(MemoryDescriptor_t) == 0x10);

        struct ThreadEntry_t
        {
            uint32_t ThreadId = 0;
            uint32_t SuspendCount = 0;
            uint32_t PriorityClass = 0;
            uint32_t Priority = 0;
            uint64_t Teb = 0;
            MemoryDescriptor_t Stack;
            LocationDescriptor32_t ThreadContext;
        };

        static_assert(sizeof(ThreadEntry_t) == 0x30);

        struct SystemInfoStream_t
        {
            ProcessorArch_t ProcessorArchitecture = ProcessorArch_t::Unknown;
            uint16_t ProcessorLevel = 0;
            uint16_t ProcessorRevision = 0;
            uint8_t NumberOfProcessors = 0;
            uint8_t ProductType = 0;
            uint32_t MajorVersion = 0;
            uint32_t MinorVersion = 0;
            uint32_t BuildNumber = 0;
            uint32_t PlatformId = 0;
            uint32_t CSDVersionRva = 0;
            uint16_t SuiteMask = 0;
            uint16_t Reserved2 = 0;
        };

        static_assert(sizeof(SystemInfoStream_t) == 32);

        constexpr uint32_t kEXCEPTION_MAXIMUM_PARAMETERS = 15;

        struct ExceptionRecord_t
        {
            uint32_t ExceptionCode;
            uint32_t ExceptionFlags;
            uint64_t ExceptionRecord;
            uint64_t ExceptionAddress;
            uint32_t NumberParameters;
            uint32_t __unusedAlignment;
            uint64_t ExceptionInformation[kEXCEPTION_MAXIMUM_PARAMETERS];
        };

        static_assert(sizeof(ExceptionRecord_t) == 0x98);

        struct ExceptionStream_t
        {
            uint32_t ThreadId = 0;
            uint32_t __alignment = 0;
            ExceptionRecord_t ExceptionRecord;
            LocationDescriptor32_t ThreadContext;
        };

        static_assert(sizeof(ExceptionStream_t) == 0xa8);

    } // namespace dmp
#pragma pack(pop)

#if defined(WINDOWS)
    class FileMap_t
    {
        //
        // Handle to the input file.
        //

        HANDLE File_ = nullptr;

        //
        // Handle to the file mapping.
        //

        HANDLE FileMap_ = nullptr;

        //
        // Base address of the file view.
        //

        PVOID ViewBase_ = nullptr;

        //
        // The end of the view - points right *after* the last byte.
        //

        PVOID ViewEnd_ = nullptr;

    public:
        ~FileMap_t()
        {
            //
            // Unmap the view of the mapping..
            //

            if(ViewBase_ != nullptr)
            {
                UnmapViewOfFile(ViewBase_);
                ViewBase_ = nullptr;
            }

            //
            // Close the handle to the file mapping..
            //

            if(FileMap_ != nullptr)
